
/*********************************************************************************************************
*名称：smgdisplay.c
*功能：数码管显示所用到的函数
创建时间：2019/7/5
修改时间：2019/7/5
作者：黄剑桥
*********************************************************************************************************/
#include "smgdisplay.h"
U8 shuju[8]={0,1,2,3,4,5,6,7};   //储存数码管显示的值
U8 code DuanMa[]={0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0x8C,0xBF,0xC6,0xA1,0x86,0xFF,0xbf};
U8 code WeiMa[]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};
/**************************************************************************
* 函数名称： DisplayData
* 参数：	 JNdata
* 功能：     向hc595传送一个字节
******************************************************************************/	   
void DisplayData (U8 JNdata)
{
    U16 i;
	for(i=0;i<8;i++)
	{
    if (JNdata&0x80) DIO=1;
	 else DIO=0;			//先读入高位   x&0x80;				
	SCLK=0;
	SCLK=1; //SCLK引脚的上升沿移入数据
	JNdata<<=1;	   	//数据向左移一位
	}  
}
 /**************************************************************************
* 函数名称： DisplayAddr
* 参数：	 j  显示的数据
* 功能：     在指定的位置显示指定的数据（指定的位置需要在这个函数控制）
******************************************************************************/
void DisplayAddr(U16 j,U8 i)
{
    U8 sum;
	U8 code *Data;//查表指针
	Data = DuanMa+shuju[j];
	sum=*Data;
	DisplayData(sum); //sum就是显示的值
	DisplayData(WeiMa[i]);//0x02即点亮第二个数码管
	RCLK=0;
	RCLK=1;//RCLK引脚更新数据					  
	Delay_us(100);
	

}
/*****************************************************************
函数：Display
功能：从99显示到0
********************************************************************/
void Display()
{
   U8 i,j,num=99;

	while(1)
	{

    for(i=0;i<2;i++)		//for循环，不断点亮数码管
    {
	 
     switch(i)
    {
		case(0):
				DisplayAddr(num/10,3); break;//显示第千位
			case(1):
				DisplayAddr(num%10,2); break;//显示第百位
				
	j=10;
	while(j--);		
	P2=0x00;				
		
    }

	}
	
		num--;		//数码管数自减
	if(num==0)	   // 显示的数若为0，则重新赋值99
	{
     num=99;
	 }
    } 
}