/*********************************************************************************************************
*名称：i2c_data.c
*功能：	i2c进行发送接收读取数据
创建时间：2019/7/5
修改时间：2019/XX/XX
作者：XXX
**********************************************************************************************************/

#include "i2c_data.h"

/*******************************************************************************
* 函 数 名         : I2C_send_byte
* 函数功能		   : 发送一个字节
*******************************************************************************/

void I2C_send_byte(U8 byte)
{
	U8 i;
	for(i = 0 ; i < 8 ; i++)
	{
		SCL = low;
		_nop_();
		if (byte & 0x80)
		{				
			SDA = high;	
			_nop_();				   
		}				
		else
		{
			SDA = low;
			_nop_();
		}
		SCL = high;
		_nop_();
		byte <<= 1;	// 0101 0100B 
	}
	SCL = low;
	_nop_();
	SDA = high;
	_nop_();
}


/*******************************************************************************
* 函 数 名         : I2C_read_byte
* 函数功能		   : 读取一个字节
*******************************************************************************/

U8 I2C_read_byte()
{
	U8 dat,i;
	SCL = low;
	_nop_();
	SDA = high;
	_nop_();
	for(i = 0 ; i < 8 ; i++)
	{
		SCL = high;
		_nop_();
		if (SDA)			    
		{
			 dat |= 0x01; //
		}
		else
		{
			dat &=  0xfe;	//1111 1110
		}
		_nop_();
		SCL = low;
		_nop_();
		if(i < 7)
		{
			dat = dat << 1;	
		}
	}
	return(dat);
}


/*******************************************************************************
* 函 数 名         : I2C_TransmitData
* 函数功能		   : 发送数据
*******************************************************************************/

bit I2C_TransmitData(U8 ADDR, DAT)
{
	I2C_Start();
	I2C_send_byte(AT24C02_ADDR+0);
	if (!Test_ACK())
	{
		return(0);
	}
	I2C_send_byte(ADDR); 
	if (!Test_ACK())
	{
		return(0);
	}
	I2C_send_byte(DAT);
	if (!Test_ACK())
	{
		return(0);
	}
	I2C_Stop();
	return(1);	
}


/*******************************************************************************
* 函 数 名         : I2C_ReceiveData
* 函数功能		   : 接收数据
*******************************************************************************/

U8 I2C_ReceiveData(U8 ADDR)
{
	U8 DAT;
	I2C_Start();
	I2C_send_byte(AT24C02_ADDR+0);
	if (!Test_ACK())
	{
		return(0);
	}
	I2C_send_byte(ADDR);
	Master_ACK(0);
	I2C_Start();
	I2C_send_byte(AT24C02_ADDR+1);
	if (!Test_ACK())
	{
		return(0);
	}
	DAT = I2C_read_byte();
	Master_ACK(0);
	I2C_Stop();
	return(DAT);	
}






