/*********************************************************************************************************
*名称：key.c
*功能：独立按键所用到的函数
创建时间：2019/7/5
修改时间：2019/7/5
作者：黄彦钊
*********************************************************************************************************/
#include "key.h"   	 
sbit key1=P4^5;				  //分别定义三个按键
sbit key2=P4^6;					 
sbit key3=P4^7;
uchar j=0;
/*******************************************************************************
* 函 数 名         : run
* 函数功能		   : 按键 +1 -1 清零
*******************************************************************************/    
void run()
{	
	display(j);		
	LED4_Display();									 
	if(j>10)	//j>10时，重新给j赋值0
	{								    
	  j=0;
	}										 
	if(j<0)	//j>10时，重新给j赋值0
	{								    
	  j=0;
	}			  	
	if(key1==0)//按下+1
	{
	   delay_us(500);
	   if(key1==0)//再次确认按键是否按下
	   {
		   j++;	//显示的数 +1		
	   }
	}
	while(!key1);
	if(key2==0)//按下-1
	{
		delay_us(500);
	    if(key2==0)//再次确认按键是否按下
	    {
		   j--;	//显示的数 -1	
	    }
	}
	while(!key2);
	if(key3==0)//按下清零
	{
	   delay_us(500);
	   if(key3==0)	//再次确认按键是否按下
	   {		   
	      j=0;	//显示的数为0	 
	   }	
	}		  
	while(!key3);
}

