/*********************************************************************************************************
*名称：DuLiKey.c
*功能：独立按键所用到的函数
创建时间：2019/7/5
修改时间：2019/7/5
作者：黄剑桥
*********************************************************************************************************/
#include "Key1.h"
U8 j=1;
/**************************************************************************
* 函数名称： Key1
* 功能：     按键 +1 -1 清零
******************************************************************************/	   
void Key1()
{
   U8 j=1;
   P1=0x00;
   while(1)
   {
   
   if(KEY1==0)//按下+1
   
   Delay_us(500);
   if(KEY1==0)//再次确认按键是否按下
   {
   j++;	//显示的数 +1
    DisplayAddr(j);					
   }
   while(!KEY1);
   if(KEY2==0)//按下-1
   Delay_us(500);
   if(KEY2==0)//再次确认按键是否按下
   {
   j--;	//显示的数 -1
   DisplayAddr(j);
   }
   while(!KEY2);
   if(KEY3==0)//按下清零
   Delay_us(500);
   if(KEY3==0)	//再次确认按键是否按下
   j=0;	//显示的数为0
   {
	DisplayAddr(j);
   }									 
   if(j>10)	//j>10时，重新给j赋值0
   {								    
   j=0;
   }
   }
}

