/*********************************************************************************************************
*名称：温湿度驱动
*功能：温度以及湿度的采集
创建时间：2019/7/15
修改时间：2019/XX/XX
作者：李诗琪
**********************************************************************************************************/

#include "includes.h"

uint Temperature[3]={1,1,1};//前两位为整数部分，后一位为小数部分
uint Humidity[2]={1,1};//传回的湿度数据只有整数部分
uchar Data_Receive[5];


int main()
{
	P3M0=0X00; //0000,0000 端口3模式寄存器0
	P3M1=0X00;
	while(1)
	{
		DHT_Collect();
	}
}
