/*********************************************************************************************************
*名称：i2c.c
*功能：IO口模拟I2C通信
创建时间：2019/7/5
修改时间：2019/XX/XX
作者：XXX
**********************************************************************************************************/

#include "../src/i2c/i2c.h"

/*******************************************************************************
* 函 数 名         : IIC_Start
* 函数功能		   : i2c开始信号
*******************************************************************************/

void IIC_Start(bit scl, bit sda, uint counter)
{
	sda = high;
	Delay_nop(counter);
	scl = high;
	Delay_nop(counter);
	sda = low;
	Delay_nop(counter);
	scl = low;
	Delay_nop(counter);
}

/*******************************************************************************
* 函 数 名         : IIC_Stop
* 函数功能		   : i2c终止信号
*******************************************************************************/

void IIC_Stop(bit scl, bit sda, uint counter)
{
	scl = low;
	Delay_nop(counter);
	sda = low;
	Delay_nop(counter);
	scl = high;
	Delay_nop(counter);
	sda = high;
	Delay_nop(counter);
}







