/*********************************************************************************************************
*名称：led.c
*功能：点亮LED对应的函数
创建时间：2019/7/4
修改时间：2019/7/4
作者：黄剑桥
*********************************************************************************************************/
#include "led.h"

void led1()
{
	 P4SW=0xbb;	//定义P4IO口
     LED1=0;
	 LED2=0;  //根据真值表点亮第一个LED
	 LED3=0;
}
void led2()
{
	 P4SW=0xbb;	//定义P4IO口
     LED1=0;
	 LED2=0;  //根据真值表点亮第二个LED
	 LED3=0;
} 
void led3()
{
	 P4SW=0xbb;	//定义P4IO口
     LED1=0;
	 LED2=0;  //根据真值表点亮第二个LED
	 LED3=0;
}