/*********************************************************************************************************
*名称：led.c
*功能：led灯对应的函数
创建时间：2019/7/4
修改时间：2019/7/4
作者：黄彦钊
*********************************************************************************************************/
#include "led.h"	  										 
#include "config.h"
#include "delay/delay.h"														
sbit LED1=P4^2;      //位定义，将stc12中的定义为LED
sbit LED2=P4^3; 	  //每一个IO口都要进行定义
sbit LED3=P4^4; 
					
/*******************************************************************************
* 函 数 名         : run
* 函数功能		   : 启动函数
					 每过50ms，led变化一次
*******************************************************************************/ 
void run()
{
	 P4SW=0xbb;	//定义P4IO口
     LED1=0;LED2=0;LED3=0;delay_ms(500);   //根据真值表点亮第1个LED	 
     LED1=0;LED2=0;LED3=1;delay_ms(500);   //根据真值表点亮第2个LED	 
     LED1=0;LED2=1;LED3=0;delay_ms(500);   //根据真值表点亮第3个LED	 
     LED1=0;LED2=1;LED3=1;delay_ms(500);   //根据真值表点亮第4个LED	 
     LED1=1;LED2=0;LED3=0;delay_ms(500);   //根据真值表点亮第5个LED	 
     LED1=1;LED2=0;LED3=1;delay_ms(500);   //根据真值表点亮第6个LED	 
     LED1=1;LED2=1;LED3=0;delay_ms(500);   //根据真值表点亮第7个LED	 
     LED1=1;LED2=1;LED3=1;delay_ms(500);   //根据真值表点亮第8个LED	 
}