/*********************************************************************************************************
*名称：display.c
*功能：数码管对应的函数
创建时间：2019/7/4
修改时间：2019/7/4
作者：黄彦钊
*********************************************************************************************************/

#include "display.h"			  
sbit DIO   = P0^0;				//串行数据输入
sbit RCLK  = P0^1;				//时钟脉冲信号——上升沿有效
sbit SCLK  = P0^2;				//打入信号————上升沿有效	

uchar code DuanMa[]={0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0x8C,0xBF,0xC6,0xA1,0x86,0xFF,0xbf};
uchar code WeiMa[]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};
	 
/*******************************************************************************
* 函 数 名         : Display
* 函数功能		   : 向hc595传送一个字节
*******************************************************************************/   
void Display (uchar JNdata)
{
    uint i;
	for(i=0;i<8;i++)
	{
    if (JNdata&0x80) DIO=1;
	 else DIO=0;			//先读入高位   x&0x80;				
	SCLK=0;
	SCLK=1; //SCLK引脚的上升沿移入数据
	JNdata<<=1;	   	//数据向左移一位
	}  
}
/*******************************************************************************
* 函 数 名         : DisplayAddr
* 函数功能		   : 在指定的位置显示指定的数据（指定的位置需要在这个函数控制）
*******************************************************************************/ 
void DisplayAddr(uchar i)
{
	uchar code *Data; 				   //查表指针
	Data = DuanMa + i;
	i=*Data;
	Display(i);					   //i就是显示的值
	Display(0x01);				//0x02即点亮第二个数码管
	RCLK=0;
	RCLK=1;					   //RCLK引脚更新数据					  

}