/*********************************************************************************************************
*名称：receive.c
*功能：spi——无线模块的定义及接收函数
创建时间：2019/7/8
修改时间：2019/7/11
作者：黄彦钊
*********************************************************************************************************/	
#include"receive.h"
 
sbit KEY8=P3^7;	 				//发送按键 
sbit beep=P2^3;					//喇叭 
sbit LED6=P1^6;	 				//发送数据时显示灯
sbit LED1=P0^0;					//接收到数据后的功能实现灯
sbit LED2=P0^1;
sbit LED3=P0^2;
sbit LED4=P0^3; 

/*******************************************************************************
* 函 数 名         : run
* 函数功能		   : 主函数运行
*******************************************************************************/ 
void run()
{
	 uchar Tx_Buf1[]={1};	//发送的信息1 
	 uchar Rx_Buf[32];  	//接收到的数据暂存器，最多32字节数据  
	 init_NRF24L01();
	 LED6=1;				//初始灯6熄灭   

	while(NRF24L01_Check())					//检查不到24l01则报警 
	{
		beep=0;
		delay_ms(200);
		beep=1;
		delay_ms(200);
	}
	while(1)
	{	
		RX_Mode();							//接收模式  
		while(!nRF24L01_RxPacket(Rx_Buf)) 	//等待接收数据,返回1则接收到数据,在等待接收数据期间,可以随时变成发送模式  
	    {
			if(KEY8==0)	 					//按了按键8,则变成发送模式,发送对应数据,发送完后变成接收模式 
			{	
				delay_ms(5);//消抖动 
				if(KEY8==0)
				{
			 		while(!KEY8);
					TX_Mode();	 //发送模式 
			    	nRF24L01_TxPacket(Tx_Buf1);		//发送命令数据
					LED6=0;
			    	delay_ms(300);
					LED6=1;
			    	delay_ms(300);					//发送后LED6闪一下 
					break;							//退出最近的循环,从而变回接收模式,这句关键
				 }	
			 }
		 }
		 //1//if(Rx_Buf[0]==1)	   						//若接收到对应的数据则实现对应功能 
		 //1//{
		 //1//   Rx_Buf[0]=0;				//清空数据 
		 //1//   LED6=0;
		 //1//	 delay_ms(300);
		 //1//	 LED6=1;
		 //1//	 delay_ms(300);				//接收到数据 后闪烁	  
		 //1//}
		switch(Rx_Buf[0]){//对数据进行分析来控制灯亮
		case 0:
			break;
		case 1:
			Rx_Buf[0]=0;				//清空数据 
		    LED1=0;
			delay_ms(300);
			LED1=1;
			delay_ms(300);	
			break;
		case 2:
			Rx_Buf[0]=0;				//清空数据 
		    LED2=0;
			delay_ms(300);
			LED2=1;
			delay_ms(300);	
			break;
		case 3:
			Rx_Buf[0]=0;				//清空数据 
		    LED3=0;
			delay_ms(300);
			LED3=1;
			delay_ms(300);	
			break;
		default:
			Rx_Buf[0]=0;				//清空数据 
		    LED4=0;
			delay_ms(300);
			LED4=1;
			delay_ms(300);	
			break;
		}	 	
	}
}
