/*********************************************************************************************************
*名称：smgdisplay.c
*功能：数码管显示所用到的函数
创建时间：2019/XX/XX
修改时间：2019/6/5
作者：XXX
*********************************************************************************************************/

#include "smgdisplay.h"

U8 code DuanMa[]={0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0x8C,0xBF,0xC6,0xA1,0x86,0xFF,0xbf};
U8 code WeiMa[]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};

/**************************************************************************
* 函数名称： Display
* 参数：	 JNdata
* 功能：     向hc595传送一个字节
******************************************************************************/	   
void Display (U8 JNdata)
{
    U16 i;
	for(i=0;i<8;i++)
	{
    if (JNdata&0x80) DIO=1;
	 else DIO=0;			//先读入高位   x&0x80;				
	SCLK=0;
	SCLK=1; //SCLK引脚的上升沿移入数据
	JNdata<<=1;	   	//数据向左移一位
	}  
}
 /**************************************************************************
* 函数名称： DisplayAddr
* 参数：	 j  显示的数据
* 功能：     在指定的位置显示指定的数据（指定的位置需要在这个函数控制）
******************************************************************************/
void DisplayAddr(U8 i)
{
	U8 code *Data; 				   //查表指针
	Data = DuanMa + i;
	i=*Data;
	Display(i);					   //i就是显示的值
	Display(0x01);				//0x02即点亮第二个数码管
	RCLK=0;
	RCLK=1;					   //RCLK引脚更新数据					  

}