/*********************************************************************************************************
*名称：display.c
*功能：不同光显示的函数
创建时间：2019/7/6
修改时间：2019/XX/XX
作者：XXX
**********************************************************************************************************/

#include "display.h"

U16 N = 100;	//	定义每个灯亮的时间、单位为毫秒、修改此值可以改变速度 

/*******************************************************************************
* 函 数 名         : Display1
* 函数功能		   : 各种颜色灯单个点亮左右流动
*******************************************************************************/
void Display1()
{
	U8 i;

	RR=0;GG=1;BB=1;//红灯亮
    for(i=0;i<8;i++)
	{ //低位向高位流动  
    	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{//高位向低位流动   
        P3 = ~(1<<7-i);
        Delay_ms(N); 
    }                
    RR=1;GG=0;BB=1;//绿灯亮
    for(i=0;i<8;i++)
	{ //低位向高位流动  
     	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{//高位向低位流动   
     	P3 = ~(1<<7-i);
        Delay_ms(N); 
    }
    RR=1;GG=1;BB=0;//蓝灯点亮
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{   
     	P3 = ~(1<<7-i);
        Delay_ms(N); 
    }
    RR=0;GG=0;BB=1;//红绿灯亮（黄色光）
    for(i=0;i<8;i++)
	{   
     	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<7-i);
        Delay_ms(N); 
    }                
    RR=0;GG=1;BB=0;//红蓝灯亮（粉红光）
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<7-i);
        Delay_ms(N); 
    }
    RR=1;GG=0;BB=0;//蓝绿灯亮（青色光）
    for(i=0;i<8;i++)
	{   
     	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<7-i);
        Delay_ms(N); 
    }
    RR=0;GG=0;BB=0;//红蓝绿灯亮（白色光）
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<i);
        Delay_ms(N); 
    }                
    for(i=0;i<8;i++)
	{   
    	P3 = ~(1<<7-i);
        Delay_ms(N); 
    }            
}


/*******************************************************************************
* 函 数 名         : Display2
* 函数功能		   : 各种颜色灯逐个点亮左右流动
*******************************************************************************/
void Display2()
{
	U8 i;

	RR=0;GG=1;BB=1;//红灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
       	Delay_ms(N); 
    }
    for(i=0;i<8;i++)
	{   
     	P3 = 0x7f>>i;
        Delay_ms(N); 
    }
    RR=1;GG=0;BB=1;//绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
        Delay_ms(N); 
    }
    for(i=0;i<8;i++)
	{   
    	P3 = 0x7f>>i;
        Delay_ms(N); 
    }
    RR=1;GG=1;BB=0;//蓝灯点亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
        Delay_ms(N); 
    }
    for(i=0;i<8;i++) 
	{   
    	P3 = 0x7f>>i;
        Delay_ms(N); 
    }
    RR=0;GG=0;BB=1;//红绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
        Delay_ms(N); 
    }
    for(i=0;i<8;i++)
	{   
    	P3 = 0x7f>>i;
       	Delay_ms(N); 
    }
    RR=0;GG=1;BB=0;//红蓝灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
        Delay_ms(N); 
    }
    for(i=0;i<8;i++) 
	{   
    	P3 = 0x7f>>i;
        Delay_ms(N); 
    }
    RR=1;GG=0;BB=0;//蓝绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
       	Delay_ms(N); 
    }
    for(i=0;i<8;i++)
	{   
    	P3 = 0x7f>>i;
        Delay_ms(N); 
    }
    RR=0;GG=0;BB=0;//红蓝绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 0xfe<<i;
        Delay_ms(N); 
    }
    for(i=0;i<8;i++)
	{   
    	P3 = 0x7f>>i;
       	Delay_ms(N); 
    }
}


/*******************************************************************************
* 函 数 名         : Display3
* 函数功能		   : 各种颜色灯全部点亮一个熄灭的灯左右流动
*******************************************************************************/
void Display3()
{
	U8 i;

	RR=0;GG=1;BB=1;//红灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
        Delay_ms(N); 
   	}
                
    for(i=0;i<8;i++)
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
    }
    RR=1;GG=0;BB=1;//绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
        Delay_ms(N); 
    }
                
    for(i=0;i<8;i++)
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
    }
    RR=1;GG=1;BB=0;//蓝灯点亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
      	Delay_ms(N); 
    }
                
    for(i=0;i<8;i++)
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
   	}
    RR=0;GG=0;BB=1;//红绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
        Delay_ms(N); 
    }
                
   	for(i=0;i<8;i++)
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
    }
    RR=0;GG=1;BB=0;//红蓝灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
        Delay_ms(N); 
    }
                
    for(i=0;i<8;i++) 
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
   	}                        
                
    RR=1;GG=0;BB=0;//蓝绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
        Delay_ms(N); 
    }
                
    for(i=0;i<8;i++)
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
    }
    RR=0;GG=0;BB=0;//红蓝绿灯亮
    for(i=0;i<8;i++)
	{   
    	P3 = 1<<i;
        Delay_ms(N); 
    }
                
    for(i=0;i<8;i++) 
	{   
    	P3 = 0x80>>i;
        Delay_ms(N); 
   	}                                                                                                                                                                                                                                                                                                                        
                               

}