/*********************************************************************************************************
*名称：display.c
*功能：屏幕显示
创建时间：2019/7/14
修改时间：2019/7/30
作者：黄彦钊
**********************************************************************************************************/

#include "display.h"

/*******************************************************************************
* 函 数 名         : OLED_FormName
* 函数功能		   : 在指定位置显示HFont字符组
*******************************************************************************/

void OLED_FormName(uchar x, y)
{
	uchar i=0,j=0;
	for(j=0;j<17;j++)
	{
		OLED_Set_Pos(x,y);
		for(i=0;i<6;i++)
		OLED_WrDat(HFont[i+j*6]);
		x+=6;
	}
}

/*******************************************************************************
* 函 数 名         : OLED_FormLine
* 函数功能		   : 在指定位置显示一条直线
*******************************************************************************/


void OLED_FormLine(uchar x, y)
{
	uchar i=0,j=0;
	for(j=0;j<18;j++)
	{
		OLED_Set_Pos(x,y);
		for(i=0;i<6;i++)
		OLED_WrDat(LineFont[i]);
		x+=6;
	}
}

/*******************************************************************************
* 函 数 名         : OLED_FormTitle
* 函数功能		   : 主标题
*******************************************************************************/

void OLED_FormTitle(uchar x,y)
{
	uchar i=0,j=0;
	for(j=0;j<13;j++)
	{
		OLED_Set_Pos(x,y);

		for(i=0;i<8;i++)
		{
			OLED_WrDat(TitleFont[j*16+i]);
		}
		OLED_Set_Pos(x,y+1);
		
		for(i=0;i<8;i++)
		{
			OLED_WrDat(TitleFont[j*16+i+8]);
		}
		x+=8;
	}
}

/*******************************************************************************
* 函 数 名         : OLED_FormTemp
* 函数功能		   : 温度标识
*******************************************************************************/

void OLED_FormTemp(uchar x,y)
{
	uchar i=0,j=0;
	for(j=0;j<5;j++)
	{
		OLED_Set_Pos(x,y);

		for(i=0;i<8;i++)
		{
			OLED_WrDat(TempFont[j*16+i]);
		}
		OLED_Set_Pos(x,y+1);
		
		for(i=0;i<8;i++)
		{
			OLED_WrDat(TempFont[j*16+i+8]);
		}
		x+=8;
	}
}

/*******************************************************************************
* 函 数 名         : OLED_FormHumi
* 函数功能		   : 湿度标识
*******************************************************************************/


void OLED_FormHumi(uchar x,y)
{
	uchar i=0,j=0;
	for(j=0;j<4;j++)
	{
		OLED_Set_Pos(x,y);

		for(i=0;i<8;i++)
		{
			OLED_WrDat(HumiFont[j*16+i]);
		}
		OLED_Set_Pos(x,y+1);
		
		for(i=0;i<8;i++)
		{
			OLED_WrDat(HumiFont[j*16+i+8]);
		}
		x+=8;
	}
}

/*******************************************************************************
* 函 数 名         : OLED_AnyChar_16X16
* 函数功能		   : 在指定位置显示一个指定的16X16字符
*******************************************************************************/

void OLED_AnyChar_16X16(uchar x, y,uchar anystr_temp[])
//x：选定行第几个像素点；y：选定的行数（以16个列像素为单位）；待显示的字符串
{
	uchar i=0;
	if(x>112)//如果指定的行超界，那么转到下一行第一个位置
	{
		x=0;y++;
	}
	
	OLED_Set_Pos(x,y);//置写入位
	
	for(i=0;i<16;i++)
	{
	OLED_WrDat(anystr_temp[i]);//在字模表中查找相应位置的字模，并写入到指定位置
	}
	
	OLED_Set_Pos(x,y+1);//写入位下移半个单位
		
	for(i=0;i<16;i++)
	{
		OLED_WrDat(anystr_temp[i+16]);
	}
}

/*******************************************************************************
* 函 数 名         : OLED_AnyChar_8X16
* 函数功能		   : 在指定位置显示一个指定的8X16字符	 
*******************************************************************************/

void OLED_AnyChar_8X16(uchar x, y,uchar anystr_temp[])
//x：选定行第几个像素点；y：选定的行数（以16个列像素为单位）；待显示的字符串
{
	uchar i=0;
	if(x>112)//如果指定的行超界，那么转到下一行第一个位置
	{
		x=0;y++;
	}
	
	OLED_Set_Pos(x,y);//置写入位
	
	for(i=0;i<8;i++)
	{
	OLED_WrDat(anystr_temp[i]);//在字模表中查找相应位置的字模，并写入到指定位置
	}
	
	OLED_Set_Pos(x,y+1);//写入位下移半个单位
		
	for(i=0;i<8;i++)
	{
		OLED_WrDat(anystr_temp[i+8]);
	}
}

/*******************************************************************************
* 函 数 名         : OLED_DataDisplay_H
* 函数功能		   : 特定的湿度数据显示函数
*******************************************************************************/

void OLED_DataDisplay_H(uchar x, y,uint display_temp[])
//x：选定行第几个像素点；y：选定的行数（以16个列像素为单位）；待显示的数字字符串
{
	uchar i=0,j=0;
	for(j=0;j<2;j++)//写整数数据
	{
		OLED_Set_Pos(x,y);//置写入位
		for(i=0;i<8;i++)
		{
			OLED_WrDat(NumberFont[display_temp[j]*16+i]);//在字模表中查找相应位置的字模，并写入到指定位置
		}
		OLED_Set_Pos(x,y+1);//写入位下移半个单位
		for(i=0;i<8;i++)
		{
			OLED_WrDat(NumberFont[display_temp[j]*16+i+8]);
		}
		x+=8;
	}
}

/*******************************************************************************
* 函 数 名         : OLED_DataDisplay_T
* 函数功能		   : 特定的温度数据显示函数
*******************************************************************************/

void OLED_DataDisplay_T(uchar x, y,uint display_temp[])
//x：选定行第几个像素点；y：选定的行数（以16个列像素为单位）；待显示的数字字符串
{
	uchar i=0,j=0;
	for(j=0;j<2;j++)//写整数数据
	{
		OLED_Set_Pos(x,y);//置写入位
		for(i=0;i<8;i++)
		{
			OLED_WrDat(NumberFont[display_temp[j]*16+i]);//在字模表中查找相应位置的字模，并写入到指定位置
		}
		OLED_Set_Pos(x,y+1);//写入位下移半个单位
		for(i=0;i<8;i++)
		{
			OLED_WrDat(NumberFont[display_temp[j]*16+i+8]);
		}
		x+=8;
	}
	x+=8;
		OLED_Set_Pos(x,y);//置写入位
		for(i=0;i<8;i++)
		{
			OLED_WrDat(NumberFont[display_temp[j]*16+i]);//在字模表中查找相应位置的字模，并写入到指定位置
		}
		OLED_Set_Pos(x,y+1);//写入位下移半个单位
		for(i=0;i<8;i++)
		{
			OLED_WrDat(NumberFont[display_temp[j]*16+i+8]);
		}
}


/*******************************************************************************
* 函 数 名         : OLED_P16x16Ch
* 函数功能		   : 显示16*16点阵  显示的坐标（x,y）y为页范围0～7
*******************************************************************************/

void OLED_P16x16Ch(uchar x, y, N)
{
	uchar wm=0;

	uchar adder=32*N;

	OLED_Set_Pos(x , y);

	for(wm = 0;wm < 16;wm++)
	{
		OLED_WrDat(F16x16[adder]);

		adder += 1;
	}
	OLED_Set_Pos(x,y + 1);

	for(wm = 0;wm < 16;wm++)
	{
		OLED_WrDat(F16x16[adder]);

		adder += 1;
	} 	  	
}

