/*********************************************************************************************************
*名称：stepperMotor.c
*功能：步进电机 对应的函数
创建时间：2019/7/4
修改时间：2019/7/27
作者：曾思茹
*********************************************************************************************************/
#include <STC12C5A.H>			  
#include "config.h"	  		  
#include "delay/delay.h"

#define speed 100 //宏定义延时函数要使用的大小

sbit a=P2^4;
sbit b=P2^5;
sbit c=P2^6;
sbit d=P2^7;	 //给管口命名

/*******************************************************************************
* 函 数 名         : X_run
* 函数功能		   : 转动函数
					 正转A-B-C-D 反转D-C-B-A 
*******************************************************************************/ 
void A_run()
{
	a=1;
	b=0;
	c=0;
	d=0;
}

void B_run()
{
	a=0;
	b=1;
	c=0;
	d=0;
}

void C_run()
{	
	a=0;
	b=0;
	c=1;
	d=0;
}
void D_run()
{
	a=0;
	b=0;
	c=0;
	d=1;
}								  
/*******************************************************************************
* 函 数 名         : run
* 函数功能		   : 使步进电机正转
*******************************************************************************/ 
void run()	 
{
		
	P1=0x00;  //0000 0000	将所有的IO关闭
	A_run();		  //A相通电，其他相断电
	delay_ms(speed);
	B_run();		  //B相通电，其他相断电
	delay_ms(speed);
	C_run();		  //C相通电，其他相断电
	delay_ms(speed);
	D_run();		  //D相通电，其他相断电
	delay_ms(speed);
}