/****************************************************/
/*模块0的PWM输出管脚为P1.3	 模块1的PWM输出管脚为1.4*/
/*  		本程序使用的是模块0						*/
/* 		将P1.3口接入ULN2003的IN口  					*/
/* 		电机的一根线接5V 一根接out口				*/
/*		修改时间：2019/6/2  						*/
/****************************************************/

#include <STC12C5A.H>
#include <intrins.h> 
unsigned char CCAP[15]={0,2,5,8,16,32,45,64,88,100,128,150,180,220,240}; //用于调配占空比

/************************************/
/*
/*		函数名：Init_PWM	
/************************************/
void Init_PWM()         //  PWM功能的初始化
{
    CMOD = 0X02;        //  设置脉冲源	 系统时钟2
 
    CCAPM0 = 0X42;      //  开启比较器，允许输出脉宽调制信号
    PCA_PWM0 = 0X00;    //  组成9位比较器
    CCAP0L = 0x80;      //  比较器中的初值
    CCAP0H = 0X80;      //  比较器初值
    CL=0;   //  装载值为0
    CR =1;  //  启动计数模式
}
 

/****************************************************/
/*                   延时函数                       */
/*		函数名：moto_delay80ms						*/
/****************************************************/  
void moto_delay80ms()   //误差 -0.00000000001us
{
    unsigned char a,b,c;
    for(c=58;c>0;c--)
        for(b=151;b>0;b--)
            for(a=49;a>0;a--);
    _nop_();  //if Keil,require use intrins.h
}




/****************************************************/
/*         赋值给CCAP0H用于改变占空比               */
/*         函数名：PWM_change     		     		*/
/****************************************************/
void PWM_change()
{
	int i;
	for(i=0;i<12;i++)
	{
		CCAP0H=CCAP[i];	//
		moto_delay80ms();
	}

}

/************************************/
/*
/*			主函数	
/************************************/
void main()
{
    Init_PWM();//初始化PWM
	while(1)
	{
		PWM_change(); //改变占空比从而改变输出电压
	}
}
