/*********************************************************************************************************
*名称：DuLiKey.c
*功能：独立按键所用到的函数
创建时间：2019/7/5
修改时间：2019/7/5
作者：黄剑桥
*********************************************************************************************************/
#include "key.h" 
   
void key()
{
   if(KEY1==0)
   
   delay_us(500);
   if(KEY1==0)//再次确认按键是否按下
   {
	  led1();				
   }
   while(!KEY1);
   if(KEY2==0)
  	 delay_us(500);
   if(KEY2==0)//再次确认按键是否按下
   {
	   led2();
   }
   while(!KEY3); 
   if(KEY3==0)
  	 delay_us(500);
   if(KEY3==0)//再次确认按键是否按下
   {
	   led3();
   }
   while(!KEY3);
}

